#+title: Contents

Brief table of contents and todo list.

** DONE other_features.py
CLOSED: [2023-03-16 Thu 22:53]
Code to test for 2000:
#+begin_src python :dir ../2000/_ :results output
import other_features as of

print(of.of.describe())

assert 'Rural' in of.of.columns
assert 'k' in of.of.columns.names
#+end_src

#+results:
:              Rural
: count  7276.000000
: mean      0.529412
: std       0.499169
: min       0.000000
: 25%       0.000000
: 50%       1.000000
: 75%       1.000000
: max       1.000000
** DONE household_characteristics.py
CLOSED: [2023-03-16 Thu 11:52]
Code to test for 2000:
#+begin_src python :dir ../2000/_ :results output
import household_characteristics as hc

print(hc.final.describe())
#+end_src

#+results:
#+begin_example
k            girls         boys  ...  Females 51-99    log HSize
count  7276.000000  7276.000000  ...    7276.000000  7276.000000
mean      1.296454     1.340297  ...       0.292331     1.514433
std       1.322475     1.345039  ...       0.488382     0.548276
min       0.000000     0.000000  ...       0.000000     0.000000
25%       0.000000     0.000000  ...       0.000000     1.098612
50%       1.000000     1.000000  ...       0.000000     1.609438
75%       2.000000     2.000000  ...       1.000000     1.945910
max       8.000000     9.000000  ...       4.000000     2.890372

[8 rows x 19 columns]
#+end_example

=======
** DONE food_acquired.py
CLOSED: [2023-03-16 Thu 14:25]
:LOGBOOK:
- State "DONE"       from "WAITING"    [2023-03-16 Thu 14:25]
- State "WAITING"    from "TODO"       [2023-03-16 Thu 11:51] \\
  EZ is working on this.
:END:
Code to test for 2000:
#+begin_src python :dir ../2000/_ :results output
import food_acquired as fa

print(fa.final.describe())
#+end_src

#+results:
:               Value  Purchased Amount
: count  36961.000000      36961.000000
: mean      21.833412         13.410879
: std       28.756041         26.375157
: min        0.150000          0.000900
: 25%        5.000000          1.452000
: 50%       12.000000          3.950000
: 75%       30.000000         12.600001
: max      600.000000        800.000000
